bench/results/raw/httparena-lite-20260924-0147/pinned-nine-rows-after-step3.log
[info] load-threads override: THREADS=6
[info] available cores: 24 | threads: 6
[info] tuning host for benchmark runs
[info] setting kernel socket limits
[info] setting UDP buffer sizes for QUIC
[info] setting loopback MTU to 1500 (realistic Ethernet)
[info] restarting docker daemon
[info] dropping kernel caches
[warn] could not restart docker daemon (no sudo?)
[info] framework: agensio (agensio, C++)
[info] subscribed tests: baseline,pipelined,limited-conn,json-tls,static-tls,baseline-h2,static-h2,baseline-h2c,json-h2c
[info] building image: httparena-agensio
#0 building with "default" instance using docker driver

#1 [internal] load build definition from Dockerfile
#1 transferring dockerfile: 1.12kB done
#1 DONE 0.0s

#2 [internal] load metadata for docker.io/library/debian:trixie-slim
#2 ...

#3 [internal] load metadata for docker.io/library/debian:trixie
#3 DONE 0.9s

#2 [internal] load metadata for docker.io/library/debian:trixie-slim
#2 DONE 0.9s

#4 [internal] load .dockerignore
#4 transferring context: 2B done
#4 DONE 0.0s

#5 [stage-1 1/5] FROM docker.io/library/debian:trixie-slim@sha256:a99cfc517144bc59b1978475ec53b46ecabec7e43635402ee5b77cc54cd1b20a
#5 resolve docker.io/library/debian:trixie-slim@sha256:a99cfc517144bc59b1978475ec53b46ecabec7e43635402ee5b77cc54cd1b20a 0.0s done
#5 DONE 0.0s

#6 [build 1/5] FROM docker.io/library/debian:trixie@sha256:9cc080028c43b27d2074d63a5f9caf7166d731494965616c1a6d2827a004585c
#6 resolve docker.io/library/debian:trixie@sha256:9cc080028c43b27d2074d63a5f9caf7166d731494965616c1a6d2827a004585c 0.0s done
#6 DONE 0.0s

#7 [internal] load build context
#7 transferring context: 1.28MB done
#7 DONE 0.0s

#8 [build 2/5] RUN apt-get update && apt-get install -y --no-install-recommends         build-essential cmake ninja-build git ca-certificates libssl-dev zlib1g-dev     && rm -rf /var/lib/apt/lists/*
#8 CACHED

#9 [build 3/5] WORKDIR /src
#9 CACHED

#10 [build 4/5] COPY src.tar.gz /tmp/src.tar.gz
#10 DONE 0.0s

#11 [build 5/5] RUN tar -xzf /tmp/src.tar.gz -C /src     && cmake -S . -B build -G Ninja -DCMAKE_BUILD_TYPE=Release -DAGENSIO_TESTS=OFF -DAGENSIO_NATIVE=ON -DAGENSIO_HTTPARENA=ON     && cmake --build build --target agensio
#11 0.296 -- The CXX compiler identification is GNU 14.2.0
#11 0.301 -- Detecting CXX compiler ABI info
#11 0.331 -- Detecting CXX compiler ABI info - done
#11 0.337 -- Check for working CXX compiler: /usr/bin/c++ - skipped
#11 0.337 -- Detecting CXX compile features
#11 0.338 -- Detecting CXX compile features - done
#11 0.343 -- asio not found on the system, fetching asio-1-38-2 from GitHub
#11 7.419 -- asio include dir: /src/build/_deps/asio-src/asio/include
#11 7.420 -- Performing Test CMAKE_HAVE_LIBC_PTHREAD
#11 7.457 -- Performing Test CMAKE_HAVE_LIBC_PTHREAD - Success
#11 7.457 -- Found Threads: TRUE
#11 7.461 -- Found OpenSSL: /usr/lib/x86_64-linux-gnu/libcrypto.so (found version "3.5.7")
#11 7.461 -- TLS enabled with OpenSSL 3.5.7
#11 7.463 -- Found ZLIB: /usr/lib/x86_64-linux-gnu/libz.so (found version "1.3.1")
#11 7.468 -- Configuring done (7.2s)
#11 7.472 -- Generating done (0.0s)
#11 7.472 -- Build files have been written to: /src/build
#11 7.585 [1/39] Building CXX object CMakeFiles/agensio_core.dir/src/http_date.cpp.o
#11 7.856 [2/39] Building CXX object CMakeFiles/agensio_core.dir/src/file.cpp.o
#11 7.856 /src/src/file.cpp: In function 'agensio::SendFileResult agensio::send_file(int, const File&, uint64_t, uint64_t, const IoSlice*, int)':
#11 7.856 /src/src/file.cpp:203:41: warning: unused parameter 'headers' [-Wunused-parameter]
#11 7.856   203 |                          const IoSlice* headers, int header_count) noexcept {
#11 7.856       |                          ~~~~~~~~~~~~~~~^~~~~~~
#11 7.913 [3/39] Building CXX object CMakeFiles/agensio_core.dir/src/mime.cpp.o
#11 7.956 [4/39] Building CXX object CMakeFiles/agensio_core.dir/src/http1/parser.cpp.o
#11 7.973 [5/39] Building CXX object CMakeFiles/agensio_core.dir/src/path.cpp.o
#11 8.184 [6/39] Building CXX object CMakeFiles/agensio_core.dir/src/response.cpp.o
#11 8.637 [7/39] Building CXX object CMakeFiles/agensio_core.dir/src/cache.cpp.o
#11 8.667 [8/39] Building CXX object CMakeFiles/agensio_core.dir/src/http2/hpack.cpp.o
#11 8.769 [9/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/log.cpp.o
#11 8.932 [10/39] Building CXX object CMakeFiles/agensio_core.dir/src/core/router.cpp.o
#11 9.649 [11/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/archive.cpp.o
#11 9.668 [12/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/reference.cpp.o
#11 10.48 [13/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/pools.cpp.o
#11 10.48 /src/src/services/pools.cpp: In function 'std::vector<std::__cxx11::basic_string<char> > agensio::check_hosting(const Config&, const HostFacts&)':
#11 10.48 /src/src/services/pools.cpp:206:37: warning: '%04o' directive output may be truncated writing between 4 and 11 bytes into a region of size 8 [-Wformat-truncation=]
#11 10.48   206 |     std::snprintf(buf, sizeof buf, "%04o", mode);
#11 10.48       |                                     ^~~~
#11 10.48 In function 'std::string agensio::{anonymous}::octal(unsigned int)',
#11 10.48     inlined from 'std::vector<std::__cxx11::basic_string<char> > agensio::check_hosting(const Config&, const HostFacts&)' at /src/src/services/pools.cpp:326:88:
#11 10.48 /src/src/services/pools.cpp:206:36: note: directive argument in the range [1, 4294967295]
#11 10.48   206 |     std::snprintf(buf, sizeof buf, "%04o", mode);
#11 10.48       |                                    ^~~~~~
#11 10.48 In file included from /usr/include/stdio.h:970,
#11 10.48                  from /usr/include/c++/14/cstdio:42,
#11 10.48                  from /usr/include/c++/14/ext/string_conversions.h:45,
#11 10.48                  from /usr/include/c++/14/bits/basic_string.h:4154,
#11 10.48                  from /usr/include/c++/14/string:54,
#11 10.48                  from /usr/include/c++/14/stdexcept:39,
#11 10.48                  from /usr/include/c++/14/system_error:43,
#11 10.48                  from /usr/include/c++/14/bits/fs_fwd.h:35,
#11 10.48                  from /usr/include/c++/14/filesystem:51,
#11 10.48                  from /src/src/services/pools.hpp:7,
#11 10.48                  from /src/src/services/pools.cpp:1:
#11 10.48 In function 'int snprintf(char*, size_t, const char*, ...)',
#11 10.48     inlined from 'std::string agensio::{anonymous}::octal(unsigned int)' at /src/src/services/pools.cpp:206:18,
#11 10.48     inlined from 'std::vector<std::__cxx11::basic_string<char> > agensio::check_hosting(const Config&, const HostFacts&)' at /src/src/services/pools.cpp:326:88:
#11 10.48 /usr/include/x86_64-linux-gnu/bits/stdio2.h:68:35: note: '__builtin___snprintf_chk' output between 5 and 12 bytes into a destination of size 8
#11 10.48    68 |   return __builtin___snprintf_chk (__s, __n, __USE_FORTIFY_LEVEL - 1,
#11 10.48       |          ~~~~~~~~~~~~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#11 10.48    69 |                                    __glibc_objsize (__s), __fmt,
#11 10.48       |                                    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#11 10.48    70 |                                    __va_arg_pack ());
#11 10.48       |                                    ~~~~~~~~~~~~~~~~~
#11 10.57 [14/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/settings.cpp.o
#11 10.94 [15/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/sites.cpp.o
#11 10.99 [16/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/client.cpp.o
#11 10.99 [17/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/httparena.cpp.o
#11 11.07 [18/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/static.cpp.o
#11 11.13 [19/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/dispatch.cpp.o
#11 11.16 [20/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/proxy.cpp.o
#11 11.25 [21/39] Building CXX object CMakeFiles/agensio_core.dir/src/upstream/fcgi_client.cpp.o
#11 11.25 [22/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/upstream_common.cpp.o
#11 11.32 [23/39] Building CXX object CMakeFiles/agensio_core.dir/src/upstream/http_client.cpp.o
#11 11.33 [24/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/fastcgi.cpp.o
#11 11.34 [25/39] Building CXX object CMakeFiles/agensio_core.dir/src/handlers/cgi.cpp.o
#11 11.41 [26/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/provision.cpp.o
#11 11.66 [27/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/install.cpp.o
#11 11.90 [28/39] Building CXX object CMakeFiles/agensio_core.dir/src/upstream/cgi_client.cpp.o
#11 11.93 [29/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/fetch.cpp.o
#11 12.93 [30/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/commands.cpp.o
#11 12.93 /src/src/control/commands.cpp: In function 'bool agensio::control::php_fpm_hard_reload(const agensio::Config&, std::string&)':
#11 12.93 /src/src/control/commands.cpp:433:25: warning: loop variable 'candidate' creates a copy from type 'const std::filesystem::__cxx11::path' [-Wrange-loop-construct]
#11 12.93   433 |     for (const fs::path candidate : {dir.parent_path() / "php-fpm.conf", dir.parent_path().parent_path() / "php-fpm.conf"}) {
#11 12.93       |                         ^~~~~~~~~
#11 12.93 /src/src/control/commands.cpp:433:25: note: use reference type to prevent copying
#11 12.93   433 |     for (const fs::path candidate : {dir.parent_path() / "php-fpm.conf", dir.parent_path().parent_path() / "php-fpm.conf"}) {
#11 12.93       |                         ^~~~~~~~~
#11 12.93       |                         &
#11 13.08 [31/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/mcp.cpp.o
#11 13.16 [32/39] Building CXX object CMakeFiles/agensio_core.dir/src/services/acme.cpp.o
#11 13.51 [33/39] Building CXX object CMakeFiles/agensio.dir/src/main.cpp.o
#11 14.68 [34/39] Building CXX object CMakeFiles/agensio_core.dir/src/control/handler.cpp.o
#11 16.67 [35/39] Building CXX object CMakeFiles/agensio_core.dir/src/config.cpp.o
#11 16.67 /src/src/config.cpp: In function 'void agensio::{anonymous}::parse_location(const toml::v3::table&, const std::filesystem::__cxx11::path&, agensio::SiteConfig&, const std::string&)':
#11 16.67 /src/src/config.cpp:463:38: warning: suggest parentheses around arithmetic in operand of '|' [-Wparentheses]
#11 16.67   463 |         loc.methods = kStaticMethods & ~method_bit(Method::options) | method_bit(Method::post);
#11 16.67       |                       ~~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#11 16.67 /src/src/config.cpp: At global scope:
#11 16.67 /src/src/config.cpp:669:1: warning: missing initializer for member 'agensio::{anonymous}::{anonymous}::PhpPreset::never_dirs' [-Wmissing-field-initializers]
#11 16.67   669 | };
#11 16.67       | ^
#11 16.67 /src/src/config.cpp:669:1: warning: missing initializer for member 'agensio::{anonymous}::{anonymous}::PhpPreset::never_dirs' [-Wmissing-field-initializers]
#11 16.67 /src/src/config.cpp:669:1: warning: missing initializer for member 'agensio::{anonymous}::{anonymous}::PhpPreset::never_dirs' [-Wmissing-field-initializers]
#11 16.67 /src/src/config.cpp:669:1: warning: missing initializer for member 'agensio::{anonymous}::{anonymous}::PhpPreset::never_dirs' [-Wmissing-field-initializers]
#11 17.94 [36/39] Building CXX object CMakeFiles/agensio_core.dir/src/upstream/client.cpp.o
#11 27.82 [37/39] Building CXX object CMakeFiles/agensio_core.dir/src/server.cpp.o
#11 27.86 [38/39] Linking CXX static library libagensio_core.a
#11 27.93 [39/39] Linking CXX executable agensio
#11 DONE 28.0s

#12 [stage-1 2/5] RUN apt-get update && apt-get install -y --no-install-recommends libssl3t64 zlib1g     && rm -rf /var/lib/apt/lists/*
#12 CACHED

#13 [stage-1 3/5] COPY --from=build /src/build/agensio /usr/local/bin/agensio
#13 DONE 0.0s

#14 [stage-1 4/5] COPY agensio.toml start.sh /etc/agensio/
#14 DONE 0.0s

#15 [stage-1 5/5] RUN chmod 0755 /etc/agensio/start.sh
#15 DONE 0.2s

#16 exporting to image
#16 exporting layers
#16 exporting layers 0.2s done
#16 exporting manifest sha256:33c5e96a749a9e6fce0f344d805ecb3eca42eb2c25b776c55910fb3fb55bdfa0 0.0s done
#16 exporting config sha256:20c74d83c43b1f27103e4aaba6ecf95bc38c9357d46e4ad5a020da080c635660 0.0s done
#16 exporting attestation manifest sha256:6c87465b256e16c14685f6e328ca8bf72443655bec30561e8f9358c4d7ee85ac 0.0s done
#16 exporting manifest list sha256:d920a7cdb4bfa2dfc0049d3c494b6d3d010147cff0c2370036274b0f80d650a6 0.0s done
#16 naming to docker.io/library/httparena-agensio:latest done
#16 unpacking to docker.io/library/httparena-agensio:latest 0.0s done
#16 DONE 0.3s

==============================================
=== agensio / baseline / 512c (tool=gcannon) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  unlimited (keep-alive)
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    281us    262us    290us    528us    670us

  9114599 requests in 5.00s, 9114087 responses
  Throughput: 1.82M req/s
  Bandwidth:  208.58MB/s
  Status codes: 2xx=9114087, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 9114087 / 9114087 responses (100.0%)
  Per-template: 3042955,3045543,3025589
  Per-template-ok: 3042955,3045543,3025589
[info] CPU 876.2% | Mem 31MiB

[run 2/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  unlimited (keep-alive)
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    280us    264us    293us    532us    669us

  9148656 requests in 5.00s, 9148144 responses
  Throughput: 1.83M req/s
  Bandwidth:  209.36MB/s
  Status codes: 2xx=9148144, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 9148144 / 9148144 responses (100.0%)
  Per-template: 3050749,3058959,3038436
  Per-template-ok: 3050749,3058959,3038436
[info] CPU 996.2% | Mem 32MiB

[run 3/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  unlimited (keep-alive)
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    280us    264us    297us    530us    677us

  9168535 requests in 5.00s, 9168109 responses
  Throughput: 1.83M req/s
  Bandwidth:  209.82MB/s
  Status codes: 2xx=9168109, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 9168109 / 9168109 responses (100.0%)
  Per-template: 3063323,3061866,3042920
  Per-template-ok: 3063323,3061866,3042920
[info] CPU 919.5% | Mem 31MiB

=== Best: 1833621 req/s (CPU: 919.5%, Mem: 31MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / pipelined / 512c (tool=gcannon) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
gcannon v0.6.1
  Target:    localhost:8080/pipeline
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  16
  Req/conn:  unlimited (keep-alive)
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency   2.06ms   2.03ms   2.55ms   2.86ms   6.15ms

  19963434 requests in 5.00s, 19955248 responses
  Throughput: 3.99M req/s
  Bandwidth:  456.68MB/s
  Status codes: 2xx=19955248, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 19955248 / 19955248 responses (100.0%)
[info] CPU 1209.6% | Mem 20MiB

[run 2/3]
gcannon v0.6.1
  Target:    localhost:8080/pipeline
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  16
  Req/conn:  unlimited (keep-alive)
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency   1.99ms   1.97ms   2.37ms   2.83ms   3.50ms

  20784983 requests in 5.00s, 20778168 responses
  Throughput: 4.16M req/s
  Bandwidth:  475.54MB/s
  Status codes: 2xx=20778168, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 20778168 / 20778168 responses (100.0%)
[info] CPU 1124.8% | Mem 20MiB

[run 3/3]
gcannon v0.6.1
  Target:    localhost:8080/pipeline
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  16
  Req/conn:  unlimited (keep-alive)
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency   2.06ms   2.12ms   2.48ms   2.82ms   3.48ms

  19954795 requests in 5.00s, 19946606 responses
  Throughput: 3.99M req/s
  Bandwidth:  456.51MB/s
  Status codes: 2xx=19946606, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 19946606 / 19946606 responses (100.0%)
[info] CPU 1209.6% | Mem 22MiB

=== Best: 4155633 req/s (CPU: 1124.8%, Mem: 20MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / limited-conn / 512c (tool=gcannon) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  10
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    355us    327us    417us    677us   1.22ms

  6612912 requests in 5.00s, 6612441 responses
  Throughput: 1.32M req/s
  Bandwidth:  151.33MB/s
  Status codes: 2xx=6612441, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 6612441 / 6612441 responses (100.0%)
  Reconnects: 661033
  Per-template: 2204107,2204238,2204096
  Per-template-ok: 2204107,2204238,2204096
[info] CPU 827.7% | Mem 39MiB

[run 2/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  10
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    351us    328us    430us    680us   1.10ms

  6674742 requests in 5.00s, 6674363 responses
  Throughput: 1.33M req/s
  Bandwidth:  152.75MB/s
  Status codes: 2xx=6674363, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 6674363 / 6674363 responses (100.0%)
  Reconnects: 667239
  Per-template: 2224781,2224757,2224825
  Per-template-ok: 2224781,2224757,2224825
[info] CPU 913.7% | Mem 36MiB

[run 3/3]
gcannon v0.6.1
  Target:    localhost:8080/
  Threads:   6
  Conns:     512 (85/thread)
  Pipeline:  1
  Req/conn:  10
  Templates: 3
  Expected:  200
  Duration:  5s


  Thread Stats   Avg      p50      p90      p99    p99.9
    Latency    348us    324us    416us    675us   1.26ms

  6738736 requests in 5.00s, 6738351 responses
  Throughput: 1.35M req/s
  Bandwidth:  154.21MB/s
  Status codes: 2xx=6738351, 3xx=0, 4xx=0, 5xx=0
  Latency samples: 6738351 / 6738351 responses (100.0%)
  Reconnects: 673652
  Per-template: 2246137,2246107,2246107
  Per-template-ok: 2246137,2246107,2246107
[info] CPU 844.4% | Mem 41MiB

=== Best: 1347670 req/s (CPU: 844.4%, Mem: 41MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio
[info] skip: agensio does not subscribe to json-comp
[info] skip: agensio does not subscribe to 8gbit
[info] skip: agensio does not subscribe to async-db

==============================================
=== agensio / baseline-h2 / 512c (tool=h2load) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2

finished in 5.13s, 10085320.00 req/s, 259.71MB/s
requests: 50426600 total, 50477800 started, 50426600 done, 50426600 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50426600 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.27GB (1361631864) total, 384.80MB (403492160) headers (space savings 91.40%), 48.09MB (50426600) data
                     min         max         mean         sd        +/- sd
time for request:      154us     34.92ms      2.81ms      2.30ms    97.63%
time for connect:     4.31ms    123.61ms     44.85ms     29.28ms    64.65%
time to 1st byte:    10.91ms    129.56ms     57.07ms     27.69ms    74.61%
req/s           :   19112.15    20256.17    19690.24      257.70    57.03%
[info] CPU 714.3% | Mem 631MiB

[run 2/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2

finished in 5.16s, 10073900.00 req/s, 259.42MB/s
requests: 50369500 total, 50420700 started, 50369500 done, 50369500 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50369500 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.27GB (1360090164) total, 384.36MB (403035360) headers (space savings 91.40%), 48.04MB (50369500) data
                     min         max         mean         sd        +/- sd
time for request:      688us     15.93ms      2.68ms       923us    93.65%
time for connect:     3.27ms     68.82ms     16.52ms      8.65ms    66.21%
time to 1st byte:    22.23ms     84.76ms     35.65ms      9.03ms    58.20%
req/s           :   19229.28    20049.26    19664.91      246.28    54.10%
[info] CPU 719.4% | Mem 629MiB

[run 3/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2

finished in 5.17s, 10093360.00 req/s, 259.92MB/s
requests: 50466800 total, 50518000 started, 50466800 done, 50466800 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50466800 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.27GB (1362717264) total, 385.11MB (403813760) headers (space savings 91.40%), 48.13MB (50466800) data
                     min         max         mean         sd        +/- sd
time for request:      239us     18.58ms      2.69ms       953us    94.23%
time for connect:     3.46ms     64.64ms     17.22ms     10.14ms    75.00%
time to 1st byte:    21.16ms     84.58ms     36.41ms     11.38ms    65.82%
req/s           :   19352.95    20092.34    19704.45      238.83    54.49%
[info] CPU 772.5% | Mem 630MiB

=== Best: 9829746 req/s (CPU: 714.3%, Mem: 631MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / static-h2 / 512c (tool=h2load) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2


finished in 5.18s, 839582.60 req/s, 12.79GB/s
requests: 4197913 total, 4214297 started, 4197913 done, 4197913 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 4197919 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 63.93GB (68645937488) total, 235.93MB (247395353) headers (space savings 72.46%), 63.61GB (68300276017) data
                     min         max         mean         sd        +/- sd
time for request:       44us    111.04ms     18.06ms     11.84ms    69.47%
time for connect:     3.63ms    689.86ms    135.53ms    152.69ms    82.81%
time to 1st byte:    32.57ms    756.44ms    165.71ms    152.56ms    82.81%
req/s           :    1086.08     2253.72     1638.54      262.36    62.89%
[info] CPU 1056.6% | Mem 342MiB

[run 2/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2

finished in 5.16s, 847209.40 req/s, 12.90GB/s
requests: 4236047 total, 4252431 started, 4236047 done, 4236047 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 4236054 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 64.51GB (69271191648) total, 238.08MB (249646084) headers (space savings 72.46%), 64.19GB (68922386340) data
                     min         max         mean         sd        +/- sd
time for request:       53us    127.56ms     18.20ms     11.42ms    68.63%
time for connect:     3.76ms    476.24ms     60.30ms     79.74ms    86.52%
time to 1st byte:    10.73ms    521.86ms     89.49ms     78.53ms    86.33%
req/s           :    1181.96     2916.21     1653.91      325.26    83.01%
[info] CPU 1204.0% | Mem 335MiB

[run 3/3]
starting benchmark...
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2

finished in 5.17s, 874494.60 req/s, 13.32GB/s
requests: 4372473 total, 4388857 started, 4372473 done, 4372473 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 4372480 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 66.59GB (71501383407) total, 245.74MB (257681476) headers (space savings 72.46%), 66.26GB (71141350677) data
                     min         max         mean         sd        +/- sd
time for request:       48us     98.82ms     17.59ms     10.57ms    67.61%
time for connect:     3.30ms    419.42ms     54.40ms     79.40ms    85.16%
time to 1st byte:    17.36ms    455.58ms     75.52ms     82.75ms    85.16%
req/s           :    1210.44     2683.43     1707.07      306.01    71.48%
[info] CPU 1086.2% | Mem 338MiB

=== Best: 845740 req/s (CPU: 1086.2%, Mem: 338MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / static-tls / 512c (tool=wrk) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   688.70us  553.78us  25.35ms   92.07%
    Req/Sec    79.37k     4.61k   84.97k    94.90%
  2321220 requests in 5.04s, 35.73GB read
Requests/sec: 460588.22
Transfer/sec:      7.09GB
[info] CPU 728.5% | Mem 65MiB

[run 2/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   678.03us  461.24us  13.61ms   79.40%
    Req/Sec    80.03k     2.42k   82.55k    92.18%
  2340422 requests in 5.05s, 36.02GB read
Requests/sec: 463575.02
Transfer/sec:      7.14GB
[info] CPU 667.1% | Mem 65MiB

[run 3/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   684.51us  495.99us  16.87ms   84.03%
    Req/Sec    79.69k     3.00k   83.83k    91.64%
  2370453 requests in 5.09s, 36.49GB read
Requests/sec: 465819.60
Transfer/sec:      7.17GB
[info] CPU 708.8% | Mem 64MiB

=== Best: 465819 req/s (CPU: 708.8%, Mem: 64MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / json-tls / 512c (tool=wrk) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   377.92us    1.13ms  36.95ms   99.60%
    Req/Sec   135.56k     9.76k  142.17k    97.62%
  3965127 requests in 5.04s, 13.46GB read
Requests/sec: 786808.51
Transfer/sec:      2.67GB
[info] CPU 589.5% | Mem 59MiB

[run 2/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   327.19us  214.09us  14.42ms   97.20%
    Req/Sec   136.31k     3.83k  141.03k    91.67%
  4068184 requests in 5.10s, 13.81GB read
Requests/sec: 797828.47
Transfer/sec:      2.71GB
[info] CPU 642.4% | Mem 60MiB

[run 3/3]
Running 5s test @ https://localhost:8081
  6 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   328.10us  227.23us  16.84ms   96.97%
    Req/Sec   136.17k     4.21k  139.57k    94.56%
  3983279 requests in 5.08s, 13.53GB read
Requests/sec: 784652.96
Transfer/sec:      2.66GB
[info] CPU 592.8% | Mem 61MiB

=== Best: 797828 req/s (CPU: 642.4%, Mem: 60MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / baseline-h2c / 512c (tool=h2load) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
starting benchmark...
Application protocol: h2c
5.
.

finished in 5.15s, 10718580.00 req/s, 276.02MB/s
requests: 53592900 total, 53644100 started, 53592900 done, 53592900 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 53592900 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.35GB (1447116076) total, 408.95MB (428816672) headers (space savings 91.40%), 51.11MB (53592900) data
                     min         max         mean         sd        +/- sd
time for request:       65us    121.65ms      3.00ms      5.67ms    98.57%
time for connect:       24us      1.60ms       567us       425us    63.67%
time to 1st byte:    15.89ms    123.22ms     61.99ms     22.92ms    66.02%
req/s           :   20131.91    22606.87    20926.13      445.75    76.56%
[info] CPU 715.4% | Mem 601MiB

[run 2/3]
starting benchmark...

Application protocol: h2c

finished in 5.15s, 10872720.00 req/s, 279.99MB/s
requests: 54363600 total, 54414800 started, 54363600 done, 54363600 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 54363600 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.37GB (1467930864) total, 414.84MB (434988160) headers (space savings 91.40%), 51.85MB (54363600) data
                     min         max         mean         sd        +/- sd
time for request:       97us     24.16ms      2.51ms      1.09ms    94.58%
time for connect:       26us     41.97ms       763us      1.90ms    99.80%
time to 1st byte:     2.88ms     56.77ms      9.84ms      4.98ms    75.00%
req/s           :   20731.66    21651.66    21226.50      199.57    66.60%
[info] CPU 679.5% | Mem 602MiB

[run 3/3]
starting benchmark...
.
.
Application protocol: h2c

finished in 5.18s, 10779340.00 req/s, 277.58MB/s
requests: 53896700 total, 53947900 started, 53896700 done, 53896700 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 53896700 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1.36GB (1455324564) total, 411.27MB (431252960) headers (space savings 91.40%), 51.40MB (53896700) data
                     min         max         mean         sd        +/- sd
time for request:      128us     21.96ms      2.53ms      1.01ms    93.22%
time for connect:       28us     38.46ms      1.26ms      4.70ms    98.44%
time to 1st byte:     3.12ms     52.16ms      9.51ms      6.37ms    92.58%
req/s           :   20550.17    21730.27    21045.80      312.08    60.55%
[info] CPU 741.7% | Mem 602MiB

=== Best: 10556038 req/s (CPU: 679.5%, Mem: 602MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio

==============================================
=== agensio / json-h2c / 512c (tool=h2load) ===
==============================================
[info] waiting for server...
[info] server ready

[run 1/3]
starting benchmark...
Application protocol: h2c
3. Stopping all clients.

finished in 5.17s, 2701417.40 req/s, 8.92GB/s
requests: 13507087 total, 13523471 started, 13507087 done, 13507087 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13507087 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 44.62GB (47910772935) total, 127.05MB (133222465) headers (space savings 90.30%), 44.27GB (47534388600) data
                     min         max         mean         sd        +/- sd
time for request:       30us    250.89ms      6.18ms      7.18ms    96.75%
time for connect:       25us     44.97ms       505us      2.00ms    99.80%
time to 1st byte:    23.83ms    252.94ms     71.45ms     50.04ms    82.62%
req/s           :    3812.13    11394.87     5275.45     1453.64    94.53%
[info] CPU 1085.1% | Mem 452MiB

[run 2/3]
starting benchmark...
Application protocol: h2c

finished in 5.17s, 2751883.80 req/s, 9.09GB/s
requests: 13759419 total, 13775803 started, 13759419 done, 13759419 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13759419 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 45.45GB (48805889952) total, 129.42MB (135709745) headers (space savings 90.30%), 45.10GB (48422476361) data
                     min         max         mean         sd        +/- sd
time for request:       28us    254.67ms      5.84ms      5.15ms    76.24%
time for connect:       26us     37.17ms       770us      3.25ms    99.22%
time to 1st byte:     1.64ms    256.00ms     30.60ms     46.99ms    84.38%
req/s           :    3515.89     9115.30     5373.86     1223.63    77.34%
[info] CPU 1205.6% | Mem 423MiB

[run 3/3]
starting benchmark...
Application protocol: h2c

finished in 5.16s, 2744491.00 req/s, 9.07GB/s
requests: 13722455 total, 13738839 started, 13722455 done, 13722455 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13722455 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 45.33GB (48674731623) total, 129.07MB (135343427) headers (space savings 90.30%), 44.98GB (48292349702) data
                     min         max         mean         sd        +/- sd
time for request:       28us    175.39ms      5.83ms      4.37ms    72.72%
time for connect:       26us     41.16ms       592us      2.56ms    99.61%
time to 1st byte:     1.45ms    176.79ms     21.53ms     33.73ms    85.55%
req/s           :    3927.69    10045.06     5359.47     1291.45    86.91%
[info] CPU 1106.4% | Mem 419MiB

=== Best: 2661396 req/s (CPU: 1205.6%, Mem: 423MiB) ===
[info] dry-run — not saving (use --save to persist)
httparena-bench-agensio
httparena-bench-agensio
[info] skip: agensio does not subscribe to baseline-h3
[info] skip: agensio does not subscribe to static-h3
[info] skip: agensio does not subscribe to unary-grpc
[info] skip: agensio does not subscribe to unary-grpc-tls
[info] skip: agensio does not subscribe to echo-ws
[info] done
[info] restoring loopback MTU to 65536